NAME    BSP_LED

        PUBLIC  Led_ShowSpectrum  ; 导出函数，让 Protocol 层可以调用

        LED_CODE SEGMENT CODE
        RSEG    LED_CODE

; ========================================================
; 函数：Led_ShowSpectrum
; 功能：根据输入的音符索引，点亮对应的 LED 频谱条
; 入口：ACC (0~21)
; 破坏：ACC, DPTR (已做内部压栈保护)
; ========================================================
Led_ShowSpectrum:
        ; --- 1. 保护现场 ---
        PUSH    ACC     ; 保护原有的 ACC
        PUSH    82H     ; 保护 DPL
        PUSH    83H     ; 保护 DPH

        ; --- 2. 核心查表与输出  ---
        
        ; 【填空 1】：把 DPTR 指针指向表格的首地址 (LED_PATTERN_TABLE)
        MOV     DPTR, #LED_PATTERN_TABLE

        ; 【填空 2】：使用 MOVC 指令，根据 ACC 里的偏移量，从表格中把灯光数据抓到 ACC 里
	MOVC    A, @A+DPTR 
        
        ; 【填空 3】：把 ACC 里抓到的灯光数据，扔给 P1 口
        MOV     P1, A
        

        ; --- 3. 恢复现场 ---
        POP     83H     ; 恢复 DPH (注意先进后出，对称原则！)
        POP     82H     ; 恢复 DPL
        POP     ACC     ; 恢复 ACC
        RET


; ========================================================
; 频谱映射表 (0表示灯亮，1表示灯灭)
; ========================================================
LED_PATTERN_TABLE:
        ; 索引 0: 休止符 (全灭)
        DB  11111111B   
        
        ; 索引 1~7: 低音区 (点亮左边 1~2 个灯，像能量条刚起步)
        DB  11111110B, 11111100B, 11111000B, 11111100B, 11111110B, 11111100B, 11111000B
        
        ; 索引 8~14: 中音区 (点亮中间的灯)
        DB  11110000B, 11100000B, 11000000B, 10000000B, 11000000B, 11100000B, 11110000B
        
        ; 索引 15~21: 高音区 (全亮或者剧烈闪烁效果)
        DB  01111110B, 00111100B, 00011000B, 00000000B, 00011000B, 00111100B, 01111110B

        END